#Использовать notify
#Использовать stream

Процедура ОбработчикФильтрации(Результат, ДополнительныеПараметры) Экспорт
	Элемент = ДополнительныеПараметры.Элемент;
	Результат = Элемент > 3;
КонецПроцедуры

ФункцияФильтрации = ОписанияОповещений.Создать("ОбработчикФильтрации", ЭтотОбъект);

Массив = Новый Массив;
Массив.Добавить(3);
Массив.Добавить(4);
Массив.Добавить(7);
Массив.Добавить(5);
Массив.Добавить(1);
Массив.Добавить(0);

// Стрим = Потоки.ИзКоллекции(Массив);
Стрим = Новый Стрим;
Стрим.УстановитьКоллекцию(Массив);

Результат = Стрим.Пропустить(2).Фильтровать(ФункцияФильтрации).Первые(2).ВМассив();
Для Каждого Элемент Из Результат Цикл
	Сообщить(Элемент);
КонецЦикла
