#Использовать "."
#Использовать delegate
// #Использовать "../delegate"

Функция ОбработчикФильтрации(ДополнительныеПараметры) Экспорт
	Элемент = ДополнительныеПараметры.Элемент;
	Результат = Элемент > 3;
	Возврат Результат;
КонецФункции

Функция ОбработчикОбработки(ДополнительныеПараметры) Экспорт
	Элемент = ДополнительныеПараметры.Элемент;
	Результат = Элемент + 1;
	Сообщить("Я - операция map, и это мое послание миру: элемент " + Элемент + " превратился в " + Результат);
	Возврат Результат;
КонецФункции

Функция ОбработчикСокращения(ДополнительныеПараметры) Экспорт
	Элемент = ДополнительныеПараметры.Элемент;
	Результат = Элемент;
	// Результат = Результат + Элемент;
	Возврат Результат;
КонецФункции

ФункцияФильтрации = Делегаты.Создать(ЭтотОбъект, "ОбработчикФильтрации");
ФункцияОбработки = Делегаты.Создать(ЭтотОбъект, "ОбработчикОбработки");
ФункцияСокращения = Делегаты.Создать(ЭтотОбъект, "ОбработчикСокращения");

Массив = Новый Массив;
Массив.Добавить(3);
Массив.Добавить(4);
Массив.Добавить(7);
Массив.Добавить(5);
Массив.Добавить(1);
Массив.Добавить(0);

ПроцессорКоллекций = Новый ПроцессорКоллекций;
ПроцессорКоллекций.УстановитьКоллекцию(Массив);

Результат = ПроцессорКоллекций
	.Пропустить(2)
	.Фильтровать(ФункцияФильтрации)
	.Первые(2)
	.Обработать(ФункцияОбработки)
	.Получить(Тип("Массив"));

Для Каждого Элемент Из Результат Цикл
	Сообщить(Элемент);
КонецЦикла;

ПроцессорКоллекций = ПроцессорыКоллекций.ИзКоллекции(Массив);
Результат = ПроцессорКоллекций
	.Сортировать()
	.ДляКаждого(ПроцессорыКоллекций.СтандартныйОбработчик_Сообщить());

Массив = Новый Массив;
Массив.Добавить(4);
Массив.Добавить(2);
Массив.Добавить(2);
Массив.Добавить(3);
Массив.Добавить(3);
Массив.Добавить(3);

ПроцессорКоллекций = ПроцессорыКоллекций.ИзКоллекции(Массив);
Результат = ПроцессорКоллекций
	.Различные()
	.ДляКаждого(ПроцессорыКоллекций.СтандартныйОбработчик_Сообщить());

ПроцессорКоллекций = ПроцессорыКоллекций.ИзКоллекции(Массив);
Результат = ПроцессорКоллекций
	.Обработать(ФункцияОбработки)
	.Сократить(ФункцияСокращения, 0);

Сообщить(Результат);

// Результат должен различаться
ПроцессорыКоллекций.ИзКоллекции(Массив).Сортировать().Первые(1).ДляКаждого(ПроцессорыКоллекций.СтандартныйОбработчик_Сообщить());
Сообщить(Массив[0]);

Строка = "ФЫВА";
ПроцессорыКоллекций
	.ИзСтроки(Строка)
	.Сортировать()
	.ДляКаждого(ПроцессорыКоллекций.СтандартныйОбработчик_Сообщить());

Строка = "Я строка с пробелами";
ПроцессорыКоллекций
	.ИзСтроки(Строка, " ")
	.ДляКаждого(ПроцессорыКоллекций.СтандартныйОбработчик_Сообщить());

Строка = "Я
|строка
|многострочная";

ПроцессорыКоллекций
	.ИзСтроки(Строка, Символы.ПС)
	.Сортировать()
	.ДляКаждого(ПроцессорыКоллекций.СтандартныйОбработчик_Сообщить());

ПроцессорыКоллекций
	.ИзСтроки(Строка, Символы.ПС)
	.Фильтровать("Результат = СтрДлина(Элемент) > 1")
	.ДляКаждого("Сообщить(Элемент)");
