#Использовать asserts
#Использовать ".."

Перем юТест;

// основной метод для тестирования
Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ПроинициализироватьПроцессорКоллекций");
	ВсеТесты.Добавить("ТестДолжен_ПроинициализироватьПроцессорКоллекцийЧерезПомощник");
	

	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_ПроинициализироватьПроцессорКоллекций() Экспорт
	ПроцессорКоллекций = Новый ПроцессорКоллекций;
КонецПроцедуры

Процедура ТестДолжен_ПроинициализироватьПроцессорКоллекцийЧерезПомощник() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзКоллекции(Новый Массив);
КонецПроцедуры
