#Использовать asserts
#Использовать ".."

// основной метод для тестирования
Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ПроинициализироватьПроцессорКоллекций");
	ВсеТесты.Добавить("ТестДолжен_ПроинициализироватьПроцессорКоллекцийЧерезПомощник");
	ВсеТесты.Добавить("ТестДолжен_ПроинициализироватьПроцессорКоллекцийИзСтрокиЧерезПомощник");
	ВсеТесты.Добавить("ТестДолжен_ПроинициализироватьПроцессорКоллекцийИзНабораЧерезПомощник");
	

	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_ПроинициализироватьПроцессорКоллекций() Экспорт
	ПроцессорКоллекций = Новый ПроцессорКоллекций;
КонецПроцедуры

Процедура ТестДолжен_ПроинициализироватьПроцессорКоллекцийЧерезПомощник() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзКоллекции(Новый Массив);
	Ожидаем.Что(ПроцессорКоллекций).ИмеетТип("ПроцессорКоллекций");
КонецПроцедуры

Процедура ТестДолжен_ПроинициализироватьПроцессорКоллекцийИзСтрокиЧерезПомощник() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзСтроки("");
	Ожидаем.Что(ПроцессорКоллекций).ИмеетТип("ПроцессорКоллекций");
КонецПроцедуры

Процедура ТестДолжен_ПроинициализироватьПроцессорКоллекцийИзНабораЧерезПомощник() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзНабора(1, 2, 3);
	Ожидаем.Что(ПроцессорКоллекций).ИмеетТип("ПроцессорКоллекций");
	Ожидаем.Что(ПроцессорКоллекций.Количество()).Равно(3);
КонецПроцедуры
