#Использовать asserts
#Использовать ".."

// основной метод для тестирования
Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ПолучитьПроцессорКоллекцииИзЗаполненнойСтроки");
	ВсеТесты.Добавить("ТестДолжен_ПолучитьПроцессорКоллекцииИзЗаполненнойСтрокиСРазделителем");
	ВсеТесты.Добавить("ТестДолжен_ДолженВернутьСтрокуИзСтроки");
	ВсеТесты.Добавить("ТестДолжен_ДолженВернутьСтрокуСРазделителемИзСтроки");
	
	// ВсеТесты.Добавить("ТестДолжен_ПроинициализироватьПроцессорКоллекцийЧерезПомощник");
	
	Возврат ВсеТесты;
	
КонецФункции

Процедура ТестДолжен_ПолучитьПроцессорКоллекцииИзЗаполненнойСтроки() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзСтроки("123");
	Результат = ПроцессорКоллекций.ВМассив();
	Ожидаем.Что(Результат).ИмеетДлину(3);
КонецПроцедуры

Процедура ТестДолжен_ПолучитьПроцессорКоллекцииИзЗаполненнойСтрокиСРазделителем() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзСтроки("1 2 3", " ");
	Результат = ПроцессорКоллекций.ВМассив();
	Ожидаем.Что(Результат).ИмеетДлину(3);
КонецПроцедуры

Процедура ТестДолжен_ДолженВернутьСтрокуИзСтроки() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзСтроки("1 2 3", " ");
	Результат = ПроцессорКоллекций.ВСтроку();
	Ожидаем.Что(Результат).ИмеетДлину(3);
КонецПроцедуры

Процедура ТестДолжен_ДолженВернутьСтрокуСРазделителемИзСтроки() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзСтроки("1 2 3", " ");
	Результат = ПроцессорКоллекций.ВСтроку(" ");
	Ожидаем.Что(Результат).ИмеетДлину(5);
КонецПроцедуры
